[
    {
        "semester": "Unknown Semester",
        "subject_code": "IT/PC/B/T/211",
        "subject_name": "Data Structures & Algorithms",
        "category": "N/A",
        "type": "N/A",
        "contact_L": 0,
        "contact_T": 0,
        "contact_P": 0,
        "credit": 0.0,
        "marks": 0,
        "topics": [
            "Algorith ms, Order Notation: Time and Space Analysis of Algorithms Sequential Representations of lists: Arrays and Lists, Linked Representation - Linear linked lists. Circular linked lists. Doubly linked lists. Operations on all types of lists. Applications. Special Lists: Stacks, Queues and their applications. Recursion: Design of recursive algorithms, Recursion vs. Iteration, Removal of Recursion Trees - Binary Trees, Traversals of binary trees, Structural properties of binary trees. Representation of binary trees in terms of pointers and arrays. General trees Binary Search",
            "Search, Insertion and Deletion algorithms, Structural properties. Threaded Binary trees. Balanced Binary Search",
            "AVL tree, B -trees, B+ - trees. Graphs: Representations, B readth -first and Depth -first Traversals, Shortest Path algorithms, Minimal Spanning Tree Algorithms Sorting and Searching Algorithms: Bubble sort, Selection Sort, Insertion Sort, Quick sort, Merge Sort, Heap sort and Radix Sort, Binary Search, Interpolati on Search. Hashing : Hashing Functions, Collision Resolution Techniques. 2nd Year 1st Semester Subject Code Subject Name Category Type Contact Credit Marks L T P IT/PC/B/T/211 Data Structures and Algo rithms PC Basic 3 0 0 3 100 IT/BS/B/T/212 Mathematics for IT -I BS Basic 3 0 0 3 100 IT/PC/B/T/213 Database Management Systems PC Basic 3 0 0 3 100 IT/PC/B/T/214 Object Oriented Programming PC Basic 3 0 0 3 100 IT/PC/B/T/215 Computer Organization and Ar chitecture PC Basic 3 0 0 3 100 IT/PC/B/S/211 Data Structures and Algorithms Lab PC Basic 0 0 3 1.5 100 IT/PC/B/S/212 Database Management Systems Lab PC Basic 0 0 3 1.5 100 IT/PC/B/S/213 Object Oriented Programming Lab PC Basic 0 0 3 1.5 100 IT/PC/B/S/ 214 Assembly and Machine Language Lab PC Basic 0 1 3 2.5 100 Sub-Total 15 1 12 Total 28 22 900"
        ]
    },
    {
        "semester": "Unknown Semester",
        "subject_code": "IT/BS/B/T/212",
        "subject_name": "Mathematics for IT -I",
        "category": "N/A",
        "type": "N/A",
        "contact_L": 0,
        "contact_T": 0,
        "contact_P": 0,
        "credit": 0.0,
        "marks": 0,
        "topics": [
            "Basics of vector algebra; Dot and Cross products of two vectors; Products of three or more vectors; Volume of tetrahedron; W ork done by a force, Moment of a force about a point . Vector calculus: Vector Calculus: Differentiation of a vector point function, Tangent and normal vectors, Directional derivatives, Gradient Divergence and Curl, Green’s, Gauss’ and Stokes’ Theorems (statement only) with applications. Ordinary Differential Equation: Ordinary differential equations of the 1st order, exactness and integrating factors, variation of parameters, Picard’s iteration method. Ordinary linear differential equation of n -th order, solutions of homogeneous and non -homogeneous equations. Operator method, Methods of undetermined coefficients and variations of parameters, systems of differential equations, Phase plane, Critical points, Stability. Linear programming: General stru cture of Linear programming model, application areas of Linear programming, solution by graphical method, simplex method (including two phase and Big -M method), duality in Linear programming. Transportation Problem: Mathematical model of Transpor tation Problem, methods for finding initial solution: North -West Corner Method, Least Cost Method, Vogel’s Approximation Method, test for optimality, variations in Transportation Problem. Assignment Problem: Mathematical model of Assignment Problem, so lution of Assignment Problem, variations in Assignment Problem."
        ]
    },
    {
        "semester": "Unknown Semester",
        "subject_code": "IT/PC/B/T/213",
        "subject_name": "Database Management Systems",
        "category": "N/A",
        "type": "N/A",
        "contact_L": 0,
        "contact_T": 0,
        "contact_P": 0,
        "credit": 0.0,
        "marks": 0,
        "topics": [
            "History of Evolution of DBMS and advantages over traditional file system, Three -schema architecture of DBMS and Data Independen ce. Introduction to DDL and DML. Ideas about different kind of users of DBMS and available databases in market. Data Model: Introduction to Relational data model and object oriented data model; Keys, Entity - Relationship Model, Relational Algebra , Tuple and Domain Relational Calculus Database Design: Conceptual database design, Different types of dependencies, Theory of normalization, preservation of dependencies, Lossless decomposition, Armstrong’s axioms, Views, Database security, SQL: Introduction to SQL, Stored Procedures and Triggers, Application development using SQL and embedded SQL programming Data Storage and Querying: Physical data structure ,Evaluation of Relational Algebra expressions; Query equivalence and Query Optimization, Join algorit hm(s) Transaction Management: Transaction Processing, Concurrency control and Recovery management ,Transaction Model Properties and State , Serializability, Lock -based and Time -stamped based Protocols, Two-phase Locking Advanced Topics: Brief introductio n to Distributed database systems, Temporal databases, Object oriented and object -relational database, Data warehousing, Data mining"
        ]
    },
    {
        "semester": "Unknown Semester",
        "subject_code": "IT/PC/B/T/214",
        "subject_name": "Object Oriented Programming",
        "category": "N/A",
        "type": "N/A",
        "contact_L": 0,
        "contact_T": 0,
        "contact_P": 0,
        "credit": 0.0,
        "marks": 0,
        "topics": [
            "Background, OOP features (Encapsulation, Abstraction, Polymo rphism, Inheritance), advantages, disadvantages, Classes and Objects Enhancements over Procedural Languages(C++): New keywords, New data types, new syntax, new I/O, Inline functions, Default function parameters, const, reference, Function Overloading it s issues and resolution. New dynamic allocation and de -allocation methods",
            "Notions of abstraction, encapsulation, information hiding and modularity. Instantiation and initialization of objects; constructor and destructor, Access Speci fication, Functions and methods; self reference of objects. Copy Constructor. Static Members. Nested Classes, C++ features: const Members, const functions. Mutables, friend function and classes,",
            "Basic concept of IS -A relatio nship. ―protected‖ access specification. Initialization derived objects, Method overriding, Abstract methods and classes. , Polymorphic method calls and dynamic binding¸ Examples, IS -A versus IMPLEMENTED -IN-TERMS -OF relationship. Multiple Inheritance, The problem of multiple occurrences of the same base and its solution",
            "Fundamental ideas. Examples of overloading with arithmetic, relational operators. Operator functions, Overloading of unary/binary operators, Overloading of ―ne w‖ and ―delete‖ operators, Member vs. non -member, Conversion Operators, Ambiguity, Explicit constructor,",
            "Streams, Standard Streams, File Streams, Opening/Reading/writing a File, Streaming to Functions, Managing I/O Streams, Bina ry Files, stream errors, Checking the I/O Status Flags",
            "The idea of exception handling and its superiority over traditional error handling. Semantics of try-catch blocks and throw",
            "Templates in C++. Function Templ ate definition and instantiation. Class Template definition and instantiation. Template Specialization. Class Template Inheritance. Standard Template Library in C++",
            "Defining namespace, using namespace"
        ]
    },
    {
        "semester": "Unknown Semester",
        "subject_code": "IT/PC/B/T/215",
        "subject_name": "Computer Organization a nd Architecture Recapitulation of Digital Logic and Circuits Boolean expression minimization techniques through fundamental theorems : Karnaugh map techniques and Quine McClauskey's tabular method. Adder, subtractor, encoder, decoder, comparator, multi plexer, parity generators etc. State Table and State Transition Diagram. Study of different types of flip -flops e.g. R -S, D-type, J -K etc. Registers, Counters. Overview of Computer Organization and Architecture : Introduction to computer system and its sub-modules ; Basic organization of computer and block level description of the functional units Arithmetic and Logic Unit, Introduction to memory Unit, control unit and Instruction Set; Working with an ALU, Concepts of Machine level programming, Asse mbly level programming and High level programming Data Representation and Arithmetic Algorithms : Number System and Representation of information: Binary Data representation, two’s complement representation and Floating -point representation. IEEE 75 4 floating point number representation. Integer Data computation: Addition, Subtraction. Multiplication: Signed multiplication, Booth’s algorithm Division of integers: Restoring and non -restoring division; floating point arithmetic: Addition, subtraction Processor Organization and Architecture : CPU Architecture, Register Organization, Instruction formats, basic instruction cycle. Instruction interpretation and Sequencing, Various addressing modes and designing of an Instruction set Hardwired control CPU design; Microprogrammed control CPU design. Micro -instruction sequencing and execution Introduction to RISC and CISC paradigm; Design issues of a RISC processor and example of an existing RISC processor Memory and I/O Organization : Concepts of semiconductor memory, CPU - memory interaction, Classifications of primary and secondary memories; Types of RAM and ROM, Allocation policies, Memory hierarchy and characteristics; Organization of memory modules; Cache memory and related mapping and replace ment policies; Cache Coherency, Interleaved and Associative Memory; Virtual memory Introduction to input/output processing, working with video display unit and keyboard and routine to control them; Programmed controlled I/O transfer; Interrupt controlle d I/O transfer; DMA controller Secondary storage and type of storage devices; Introduction to buses and connecting I/O devices to CPU and memory Introduction to Parallel Processing System : Introduction to pipelining; Flynn’s classifications; pipeline processing and pipeline hazards; design issues of pipeline architecture; Instruction level parallelism and advanced issues. Introduction to interconnection network and practical issues; Examples of interconnection networks Parallel processing concept s; Parallelism algorithm for multiprocessor systems (IT/PC/B/S/211) Data Structures and Algorithms Lab Develop and demonstrate programs for  Defining operations on arrays and different types of lists and their applications like polynomial operations, s parse matrix transposition etc.  Representing stacks, queues and defining operations on them  Applications of stack like infix expression evaluation etc.  Defining operations like search, insertion, deletion etc. on binary search Trees.  Defining operations l ike search, insertion, deletion etc. on balanced binary search Trees  Representing graphs and defining operations such as Breadth -first, Depth -first Traversals, finding Shortest Path algorithms, finding Minimal Spanning Tree  Arranging a list using sorting algorithms such as Bubble sort, Selection Sort, Insertion Sort, Quick sort, Merge Sort, Heap sort etc.  Searching in a list using Binary Search and hashing (IT/PC/B/S/212) Data Base Management Systems Laboratory  Design ER diagram and Schema for simple case studies.  Develop simple and complex queries using SQL and develop Applications.  Construct user interfaces and generate reports using utilities typically available with RDBMS packages.  Practice developing applications using embedded SQL on host langu ages.  Solve problems using PL/SQL, Stored Procedures, Curser and Triggers. (IT/PC/B/S/213) Object Oriented Programming Laboratory Develop and demonstrate programs using  const, reference, inline function, function overloading, default function paramete rs, dynamic memory allocation, basic I/O  Classes, nested classes, access control, constructors, destructors, copy constructors, this pointer, static members, const members, mutable fields, friend function and classes  Operator overloading, conversion opera tors, ambiguity and resolution  Inheritance, access specifiers overriding functions, polymorphism, virtual function/pure virtual function, virtual destructor  Namespace: name clash, creating and using namespaces  Exception Handling: throwing and catching, re -throwing exceptions, exception specifications, exception classes  Templates: template function, template parameter, function template overloading, template function specialization, class templates, template specialization, type conversion, ambiguity, Standa rd Template Library(STL)  File I/O (IT/PC/B/S/214) Assembly and Machine Language Lab  Introduction to single board microcomputer system.  Develop and execute simple assembly language programs to get familiar with the instruction set.  Develop assembly langu age programs like sorting, finding maximum and minimum numbers on a list.  Develop assembly language programs involving subroutines and parameter passing  Develop assembly language programs involving input output programs using peripheral interface.  Develop assembly language programs for string handling and string manipulation.  Generate Machine level program from Assembly language program.  Develop simple machine language program using 8086(or higher) microprocessor kit involving decisions, loops etc. (IT/PC/B/T/221) Object Oriented Systems Relevance of Java in Distributed Programming Environment : Object Oriented Programming language suitable for use in distributed environments. Concept of The Virtual Machine to facilitate portability, data type s, expressions, statements, arrays Classes, Objects, Interface, Inheritance : Access Specification, Instantiation, Initialization, Finalization, Methods, Static Members, String and String Buffer Classes, Derived classes, Abstract classes, Interfaces Input /Output: Stream Classes, Reader Classes, Writer Classes, File Input, File Output, Formatted Data Input and Output Package and Nested Classes: package and package access specification, inner classes, local inner classes, anonymous classes. Thread Programm ing: Thread creation; mutual exclusion implementation, Synchronization primitives. Introspection as a capability to develop software component: Java Reflection, Java Beans Distributed Software Development: Remote Method Invocation using Java RMI 2nd Year 2nd Semester Subject Code Subject Name Category Type Contact Credit Marks L T P IT/PC/B/T/221 Object Oriented Systems PC Basic 3 0 0 3 100 IT/BS/B/T/222 Mathematics for IT -II BS Basic 3 0 0 3 100 IT/PC/B/T/223 Software Engineering PC Basic 3 0 0 3 100 IT/PC/B/T/224 Graph Theory and Combinatorics PC Basic 3 0 0 3 100 IT/PC/B/T/225 Computer Networks PC Basic 3 0 0 3 100 IT/PC/B/T/226 Graphics and Geometric Modeling PC Basic 3 0 0 3 100 IT/PC/B/S/221 Object Oriented Systems Lab PC Basic 0 0 3 1.5 100 IT/PC/B/S/222 Computer Networks Lab PC Basic 0 0 3 1.5 100 IT/PC/B/S/223 Software Engineering Lab PC Basic 0 1 3 2.5 100 Sub-Total 18 1 9 Total 28 23.5 900 Intro duction to UML : Use case diagrams, Sequence and Collaboration Diagrams, State chart diagrams, Activity Diagrams etc. Forward engineering (Code and Test case generation) and Reverse Engineering using UML diagrams. Object Oriented Design and Analysis Software Re -usability: Introduction to Design Patterns. (IT/BS/B/T/222) Mathematics for IT -II Probability: Introduction to probability : Sample space, Classical, and axiomatic definitions of probability, addition rule and conditional probability, multipl ication rule, total probability, Bayes’ Theorem and independence, problems. Random Variables: Discrete, continuous and mixed random variables, probability mass, probability density and cumulative distribution functions, expectation, variance & Standa rd Deviation, Chebyshev’s inequality. Special Distributions : Discrete Distribution Binomial & , Poisson Distribution related problems ; continuous Distribution uniform, exponential, normal Distribution & related problem, Determine of mean & variance f or Binomial , Poisson, uniform & normal Distribution. . Statistics: Measures of Central Tendency: Introduction, Mean, Median & Mode, relation between Mean, Median & Mode; moments, skewness & kurtosis. Correlation & regressi on. Random sampling . Parameter, Statistic and its Sampling distribution, Standard error of statistic. Sampling distribution of sample mean and variance, random sampling from a normal distribution (statement only) and related problems; Estimation of Parameters : Unbiased and consistent estimators, Point estimation, Interval estimation, Maximum likelihood estimation of parameters of Binomial and Poisson distribution. Maximum likelihood estimation of parameters of Normal distribution, Confidence inter vals and related problems. . Applied Statistics : Curve fitting of straight lines, second degree parabola. Operation Research: Game Theory: Introduction, Characteristics of Game Theory, Two Person, Zero sum games, Pure strateg y. Dominance theory, Mixed strategies (2x2, mx2), Algebraic and graphical methods Inventory Control: Inventory classification, Different cost associated to Inventory, Economic order quantity, Inventory models with deterministic demands, ABC analysis. Queuing Theory: Basis of Queuing theory, elements of queuing theory, Kendall’s Notation, Operating characteristics of a queuing system, Classification of Queuing models, Preliminary examples of M/M/1:8/FCFA Project Management: Introduction to PERT and CPM , critical Path calculation, float calculation and its importance. Cost reduction by Crashing of activity. (IT/PC/B/T/223) Software Engineering",
        "category": "N/A",
        "type": "N/A",
        "contact_L": 0,
        "contact_T": 0,
        "contact_P": 0,
        "credit": 0.0,
        "marks": 0,
        "topics": [
            "Evolution of software, Definition of Software Engineering, Software Production Process a nd life Cycle models -Build and fix, Waterfall, Rapid prototyping, incremental, evolutionary, Reuse oriented Development and sprial models, comparative analysis of models. Software Prototyping.",
            "Definition of Requirements engineerin g and its importance. Analysis Heuristic -abstraction, partitioning, view theo points. Tools of structured analysis, namely, data flow diagrams, data dictionary, data structure analysis, entity relation diagrams, state transition diagram, standard requireme nt analysis methodologies.",
            "Design phase in life cycle, System Design Definitions, Concept and methodologies, data flow oriented Design, Program Design and the requirements, features, classification and use of a CASE tool. Different flavors of architectural representations. Cohesion, coupling and Modularity. Definition and overview of data oriented design methods. Using Entity Relationship analysis in system design, Entity -life-cycle modelling. Coding Standards and Guidelines. Software Te sting and Verification :. Black box and white box testing. Unit testing, integration testing, system testing. Techniques to generate test plans. Mathematical methods of software verification. Alpha and Beta testing. Verification and Validation. Software Mea surements and Metrics.",
            "A SCM scenario, elements of a configuration management system, software configuration items, SCM repository, SCM process",
            "Quality, quality control, quality assurance, cost of quality",
            "Capability Maturity Model Integration, ISO 9001"
        ]
    },
    {
        "semester": "Unknown Semester",
        "subject_code": "IT/PC/B/T/224",
        "subject_name": "Graph Theory and Combinatorics",
        "category": "N/A",
        "type": "N/A",
        "contact_L": 0,
        "contact_T": 0,
        "contact_P": 0,
        "credit": 0.0,
        "marks": 0,
        "topics": [
            "Different examples, (dis)connected graph, sub -graph, isomorphism, labeled graph, Euler graph, Hamiltonian graph, Counting on graph.",
            "deletion of vertex/edge, fusion, union, intersection, ring sum, decomposition of a graph.",
            "definition of cut set, edge connectivity, vertex connectivity, cut vertex, relation with edge c onnectivity and vertex connectivity, k -connected graph, separable graph, 1 -isomorphism, 2 - connected graph, 2 -isomorphism.",
            "definition with examples, non -planar graph, Euler theorem, planarity detection, geometric dual graph, uniqueness of dua l, dual of a sub -graph, combinatorial dual, self -dual, maximal planar graph.",
            "definition, chromatic number, chromatic partition, independent set, dominating set, chromatic polynomial.",
            "definition, complete matching. Coveri ng: minimal covering, perfect matching, vertex cover.",
            "incidence matrix , adjacency matrix, – Sub-matrices – Circuit Matrix – Path Matrix",
            "Types of Directed Graphs, Digraphs and Binary Relations, Directed Paths and Connectedness, Adjacency Matrix of a Digraph.",
            "definitions, center, radius, diameter, rooted tree; spanning tree, spanning forest, rank & nullity of a graph, fundamental circuit, tree graph, number of spanning tree in complete graph: Prufer sequence. Cobminatorics :",
            "sum rule, subtraction principle, product rule, division principle, permutations, r - permutation, combinatorics, sampling problem (with replacement), occupancy problem, binomial coefficient, binomial theorem, multinomial coefficient",
            "the principle (simple and its generalization), application of the principle.",
            "Concept of Venn diagram and counting by Venn diagram, inclusion and exclusion princi ple, applications of the principle to solve different problems like Occupancy problem, Chromatic polynomial, Derangement problem, Rook polynomials, etc.",
            "power series and its properties, (ordinary) generating function, generating function for a sequence and conversely. Operations on generating function, application of generating function in counting problem, exponential generating function and its application to counting problem.",
            "definition with examples, recurren ce with more than one sequences, simplification of recurrence relation by: characteristic roots (in case of linear homogenous recurrence relation), generating function."
        ]
    },
    {
        "semester": "Unknown Semester",
        "subject_code": "IT/PC/B/T/225",
        "subject_name": "Computer Networks",
        "category": "N/A",
        "type": "N/A",
        "contact_L": 0,
        "contact_T": 0,
        "contact_P": 0,
        "credit": 0.0,
        "marks": 0,
        "topics": [
            "Communication Tasks, Communication M odel, Network Architecture, ISO/OSI Reference Model, Switching, TCP/IP Model",
            "One and Two Dimensional Parity Checks, CRC, Hamming code, Framing: Bit and Character Stuffing,",
            "Delays in Point -to-Point links, Stop -and-Wait Flow Control, Effect of Propagation Delay and Transmission Rate on Performance, Sliding Window Protocol, Error Control - ARQ: Stop and Wait, Go-back -N, Selective Reject etc. Transmission Efficiency of ARQ Protocols.",
            "HDLC, Point -to-Point Protocol.",
            "Channel Allocation Problem, Static and Dynamic Channel Allocation, Pure and Slotted ALOHA, Persistent and non-persistent CSMA,",
            "Bit -Map protocol, Binary Countdown, Limited Contention protocols, Adaptive Tree Walk protocols,",
            "Ethernet, Token Bus, Token Ring, DQDB, FDDI, LAN Bridges: IEEE 802.x to IEEE 802.y Bridges, Transparent Bridge, Source Routing Bridge, Mixed Media Bridge etc .",
            "Services, Packet Switching, Congestion",
            "Routing Characteristics, Routing Algorithms -Shortest Path algorithm: Dijkstra's Algorithm, Bellman -Ford Algorithm, Fixed Routing, Flooding, Random Routing, Adaptive Routing: Flow b ased Routing, Distance Vector Routing, Link State Routing, Hierarchical Routing, Broadcast and Multicast Routing: Multi -destination routing, Spanning Tree Routing, Reverse Path Forwarding,",
            "General principles. Congestion Prevention Policies, T raffic Shaping, Leaky -Bucket Algorithm, Token Bucket Algorithm.",
            "IPV4 Datagram Formats, IPV4 Packet Forwarding Unicast and Multicast Routers",
            "UDP, TCP: Services; TCP Flow Control, TCP Error control, TCP congestion control, TCP timers"
        ]
    },
    {
        "semester": "Unknown Semester",
        "subject_code": "IT/PC/B/T/226",
        "subject_name": "Graphics and Geometric Modeling",
        "category": "N/A",
        "type": "N/A",
        "contact_L": 0,
        "contact_T": 0,
        "contact_P": 0,
        "credit": 0.0,
        "marks": 0,
        "topics": [
            "Objective, applications, Graphics Standards, normalized co -ordinate system, aspect ratio.",
            "Video Display Devices, Raster -Scan and R andom -Scan Systems, Graphics Monitors and Workstations, Input and Hard Copy Dev ices, Graphics Software.",
            "Line drawing algorithms, circle/ellipse drawing algorithms, polygon fillingalgorithms.",
            "Homogeneous co -ordinate system, 2D and 3D transformations, projection — orthographic and perspective.",
            "Curve approximation and interpolation, Lagrange, Hermite, Bezier and BSpline curves/surfaces and their properties, curves and surface drawing algori thms.",
            "Window and viewport, 2D and 3D clipping algorithms.",
            "Concept of object - and image -space methods, lines and surface removal algorithms.",
            "RGB, YIQ, HLS and HSV models and their con versions, gamma correction, half -toning.",
            "illumination models, polygon mesh shading, transparency, shadow, texture. Geometric modeling : 3D object representation and its criteria, edge/vertex list, constructive solid geometry, wire -frame model, generalized cylinder, finite element methods.",
            "(i) Animation and morphing, (ii) Virtual reality, (iii) User -interface design, (iv) Fractal graphics, (v) Multimedia authoring, (vi) 3D visualization. (IT/PC/B/S/221) Object Oriented Systems Lab  Develop Java programs using (i) classes, (ii) inheritance, (iii) nested classes and (iv) Exceptions  Develop Java programs to solve problems using thread programming  Develop programs using advanced programming paradigms: (i) Introspect ion capabilities, and (ii) Generic Programming.  Model software systems by using different artifacts of Unified Modeling Language  Develop Java Programs to solve problems using design patterns (IT/PC/B/S/222) Computer Networks Lab Part-I: Network Assignm ents 32 hours  Network tools (learning some network commands) : ipconfig, ping, traceroute, talk, tcpdump, routing table related commands, firewall related etc.  Socket programming: TCP socket, UDP socket, raw socket and application developments  Implementatio n: ARQ protocols, window protocols etc.  Network packet analysis : wireshark, pcap etc.  Part-II: Simulations 16 hours  Overview of network simulators : NS-2/3, OMNET++ etc.  Case studies : routing algorithms and other algorithms using simulators (IT/PC/B/S/223) Software Engineering Lab  Be familiar with automated test tools and develop test suite using them.  Be familiar with Build tools and write scripts using them for making executables  Be familiar with version control tools and use them for development and rele ase of software.  Be familiar with coding frameworks and use them to develop software systems. Elective -I (IT/PE/B/T/311 A) Cloud Computing Introduction to Cloud Computing Cloud computing at a glance – The vision of cloud computing, Definition of cloud computing, The cloud computing reference model, Characteristics and benefits of cloud computing. Evolution of cloud comput ing – parallel computing, distributed computing, cluster computing, grid computing, virtualization, Web 2.0, Client/Server computing, P2P computing, service -oriented computing and utility -3rd Year 1st Semester Subject Code Subject Name Category Type Contact Credit Marks L T P IT/PE/B/T/311A Cloud Computing Elective -I PE Basic 4 0 0 4 100 IT/PE/B/T/311B Sensor Networks IT/PE/B/T/311C Artificial Intelligence IT/PC/B/T/312 Wireless and Mobile Networks PC Basic 3 0 0 3 100 IT/PC/B/T/313 Web Technologies – I PC Basic 3 0 0 3 100 IT/PC/H/T/314 Automata and Compiler PC Honou rs 4 0 0 4 100 IT/PC/B/T/315 Operating Systems PC Basic 3 0 0 3 100 IT/PE/B/S/311A Cloud Computing Lab Elective -I Lab PE Basic 0 0 3 1.5 100 IT/PE/B/S/311B Sensor Networks Lab IT/PE/B/S/311C Artificial Intelligence Lab IT/PC/H/S/312 Compiler Lab PC Honours 0 0 3 1.5 100 IT/PC/B/S/313 Operating System Laboratory PC Basic 0 0 3 1.5 100 Sub-Total 17 0 9 Total 26 21.5 800 oriented computing. Business driver for adopting cloud computing. Cl oud Service Models – IaaS, PaaS, SaaS, XaaS. Cloud Deployment Models – Private, Public, Hybrid, Community, Cloud Federation. Virtualization Technologies Introduction to virtualization. Characteristics of virtualized environment – Security, Managed execut ion, Portability. Types of Virtualization – Bare Metal and Hosted. Hardware level virtualization – Machine(x86) reference model, Hypervisor, Hardware assisted virtualization, Full virtualization, Paravirtualization. Operating system level virtualization. Other types of virtualization – storage virtualization, Network virtualization, Desktop virtualization. VM Migration techniques. Pros and cons of virtualization. Case studies – Xen, VMware and Microsoft Hyper -V. Cloud Services and Platforms Compute serv ices using several case studies: Storage Services, Database Services, Database and Table Service. Application Services, Email service. Content Delivery Services. Analytics Services Deployment and Management Services,. Open Source Cloud Platform – CloudStac k, Eucalyptus, OpenStack. Management of Cloud Resources Lifecycle management of cloud applications. Monitoring cloud resources. Feedback control based on dynamic thresholds, Bag -of-Task (BoT) scheduling problems, VM Placement problems, Resource bundling, combinatorial auctions, fair queuing, borrowed virtual time, Cloud scheduling subject to deadlines, Cost and Energy efficient Scheduling algorithms, Scheduling in Federated environment. Identity and Access management for Cloud Resources. Cloud Security Security architectures to assure secure isolation of physical and logical infrastructures including compute, network and storage, comprehensive data protection at all layers, end -to-end identity and access management, monitoring and auditin g processes and compliance with industry and regulatory mandates. Industry security standards, regulatory mandates, audit policies and compliance requirements for Cloud based infrastructures. (IT/PE/B/T/311B ) Sensor Networks Basics of sensor network: Individual components of sensor network nodes, Network Architecture, Optimization Goals and Design Principles Communication Protocols in sensor networks: MAC Protocols and their taxonomy, Some example protocols like SMAC, CSMA Protocols, Leach, IEEE 802.15 .4 MAC , Bluetooth and Bluetooth LE Topology Control: Topology control in flat networks and hierarchical networks, Clustering, Combining Power control and hierarchical netw orks Routing: Gossiping and Agent Based Unicast, Energy efficient unicast, Broadc ast and multicast, Geographic routing, Data Centric Ro uting and Data Aggregation Transport Layer and Quality of Service, Coverage and Deployment, Reliable Data Transport, Single packet Delivery and Block delivery, Congestion Control and Rate Control Attacks and Security Issues (IT/PE/B/T/311C ) Artificial Intelligence Overview : foundations, scope, problems, and approaches of AI. Intelligent agents : reactive, deliberative, goal -driven, utility -driven, and learning agents Heuristic Search: Measuring pro blem solving performance , details of Blind search and Heuristic search strategies: Greedy best -first search, A* search, AO* search, memory bounded heuristic search: local search algorithms & optimization problems: Hill climbing search, simulated annealing search, local beam search , learning heuristics from experiences Constraint satisfaction problems : Local search for constraint satisfaction problems. Adversarial search, Games, optimal decisions & strategies in games, the minimax search procedure, alpha -beta pruning, additional refinements, iterative deepening. Knowledge representation, Reasoning and Expert System: knowledge based Agents, propositional Logic, Representing simple fact in logic, representing instant & ISA relationship, Representing knowledge u sing rules. First-Order Logic, Resolution and inference in First -Order Logic Logic programming: forward versus backward reasoning, matching Planning : planning as search, partial order planning, construction and use of planning graphs Representing and Reas oning with Uncertain Knowledge : probability, connection to logic, independence, Bayes rule, bayesian networks, probabilistic inference, sample applications. Decision -Making : basics of utility theory, decision theory, sequential decision problems, elementar y game theory, sample applications. (IT/PC/B/T/312 ) Wireless and Mobile Networks Wireless Transmission and Media Access Control: Transmission Fundamentals, Frequencies and regulations, Signals, Antennas and Signal propagation, Propagation Models, Fading, Multiplexing, Modulation Techniques, Spread Spectrum modulation(FHSS, DSSS), CDMA Wireless Link Improvement Technique, Equalization , Diversity, Error detection, Block Error correction codes, RLP, Convolutional codes. Motivation, Wireless Issues, FDMA, TD MA, CDMA, SDMA, Fixed ALOHA, CSMA -CA, MACA, Multiple Accesses with Collision Avoidance, Packet Radio Access. Mobile Telecommunication Systems: GSM, UMTS, IMT -2000, GPRS, LTE and L TE-A Wireless LANs: Wireless LANS - 802.11 standards, 802.11 MAC management, 802.11 Framing, 802.11 Architecture and services, Physical layer WMAN, Bluetooth, WPAN, IrDA technologies. Mobility Management: MIPv4, MIPv6, HiMIPv6, Cellular IP, HAWAI, HMIPv6, FMIPv6, PMIPv6, NEMO, DMM. Mobile Adhoc Networks: Routing protoc ols: DSDV, DSR, and AODV Transport Protocols: Traditional TCP, I-TCP, SNOOP, TCP -Freeze, TCP Westwood (IT/PC/B/T/313 ) Web Technologies – I Web Basics: Introduction, Internet and WWW, Histor y, Web Server, Web Browser, URL, Basic Protocols, S ecure connections, Setting up web servers HTML: History, Document Structure, Basic syntax, XHTML, Important tags(e.g. Hyperlink, Lists, Tables, Frames, Images, and Multimedia, Meta tags), Form and form elements, Form submission, Web design Cascading Style Sheets: Introduction, Advantages, Types of CSS, Syntax, Cascading Rue, Selectors, CSS and page Layout, Overview of CSS3 JavaScript : Variables, Arrays, Functions, Objects, Regular Expression, Brows er Object Models, DHTML, Event Handing, DOM, DOM Tree, working with DOM, Working with HTML Forms, Form Verification, AJAX: advantages & disadvantages, Operational principle, AJAX alternatives HTML5: HTML5 tags(new Inputs, Semantic elements, Canvas, SVG, Media), HTML5 JavaScript API: Geo-location, Drag -and-Drop, File API, Web Storage, IndexedDB, Application cache, Web Workers, WebSocket, Server Sent Events, JavaScript Object Notation (JSON): JSON Syntax, Data Types, JSON Parsers, JSON Data Transfer Betwee n Client and Server, examples, JQuery: Introduction, Selectors, DOM, Events, AJAX, UI XML Technologies: Introduction, Features of XML, Anatomy of XML documents, Namespace, Valid XML, Document Type Definition(DTD): Building blocks, Syntax, W3C XML Schem a: Syntax, Data Types, Elements, Attributes, Restrictions, Validation, XPath, XQuery: FLWOR, Syntax, Functions, XML DOM, Parsing XML, eXtensible Stylesheet Language Transformations (XSLT), XSL -FO. (IT/PC/H/T/314 ) Automata and Compiler Finite Automata ( FA): DFA, NFA, Conversion from NFA to DFA, Finite State Machines (Moore and Melay machine). Regular language: Regular set, regular expression, closure properties of regular languages, pumping lemma for regular language, decision problem for regular langu ages. Context free grammar: Definition of grammar, derivation, parse tree, language of a grammar, Chomsky classification of grammar (or language), regular grammar - left liner & right linear grammar, regular grammar & FA. Ambiguity in context -free grammar , Chomsky normal form, pumping lemma for CFG, closure properties of CFL (or CFG), proving some languages are not context -free. Push Down Automata (PDA): Push down automata, PDA string acceptance by empty stack and by final state, examples of equivalence of PDA acceptance, Conversion from CFG to PDA, introduction to DPDA & DCFL. Turing machines: Turing machine with examples, variations of basic Turing model: multiple tapes, multi tracks, non -deterministic TM, universal TM, TM as enumerator. Recursive ly enumerable languages: Definition of recursive & recursively enumerable language, closure properties of recursive & recursively enumerable languages, contex t sensitive language (Un)Decidability: Decidability, undecidability, halting problem, undecidab ility of halting problem, mention of other unsolvable problems. Overview of Compiler structure: Various phases of a compiler Lexical analysis: Regular Expression, for Tokens, DFA Based Lexical Analyzer. Syntax analysis: Top down parsing: LL(1) parser; bottom up parsing: SLR, LR(1) LALR, Parser Intermediate code generation: intermediate representations, translation of declarations, assignments, control flow, Boolean expressions, procedure calls, records, arrays, Implementation issues. Run tim e system: storage organization, activation tree, activation record, param eter passing, symbol table Introduction to Code optimization: Basic blocks, loc al and global optimizations (IT/PC/B/T/315 ) Operating Systems",
            "Operating system func tions, evaluation of O.S., Different types of O.S.: batch, multi - programmed, time -sharing, real -time, distributed, parallel. System Structure: Different types of protections, operating system structure (simple, layered, virtual machine), O/S services, sys tem calls. Process Management: Concept of processes, process scheduling, operations on processes, co -operating processes, inter -process communication. Threads: overview, benefits of threads, user and kernel threads. CPU scheduling: scheduling criteria, p reemptive & non -preemptive scheduling, scheduling algorithms (FCFS, SJF, RR, and priority), and algorithm evaluation, multi -processor scheduling. Process Synchronization: background, critical section problem, critical region, synchronization hardware, clas sical problems of synchronization, semaphores, examples (producer -consumer, readers - writer, dining philosophers, etc.). Deadlock: Deadlocks system model, deadlock characterization, methods for handling deadlocks, deadlock prevention, deadlock avoidance, d eadlock detection, recovery from deadlock. Storage Management: Background, logical vs. physical address space, swapping, contiguous memory allocation, paging, segmentation, segmentation with paging. Virtual Memory: background, paging and segmentation, d emand paging, performance, page replacement, page replacement algorithms (FCFS, LRU), allocation of frames, thrashing. File Systems: file concept, access methods, directory structure, file system structure, allocation methods (contiguous, linked, indexed) , free -space management (bit vector, linked list, grouping), directory implementation (linear list, hash table), efficiency & performance. I/O Management: Blocking and non -blocking I/O, kernel I/O subsystem (scheduling, buffering, caching, spooling and de vice reservation, error handling), performance. Disk Management: disk structure, disk scheduling (FCFS, SSTF, SCAN, C -SCAN), disk reliability, disk formatting, boot block, bad blocks. Elective -I Lab (IT/PE/B/S/311A ) Cloud Computing Lab Enabling instance objects on Simple Storage Service in the cloud and wri ting programs to access objects; Study the Cloud Sim simulator; Write programs for Resource Schedu ling in Cloud using a simulator; Developing a Virtual Private Cloud with two subnets, configured differ ently regarding security; Develop programs to interact with a cache cluster ; Develop programs to create and perform queries in a R elational database in the cloud; Develop programs to create and perform queries in a No SQL database in the cloud; Write a pr ogram for auto -scaled cluster to process informat ion in a distributed queue; Develop programs that run in containers to access the cloud; Write a (Hive) script to perform a Map -Reduce job on a cloud. (IT/PE/B/S/311B ) Sensor Networks Lab Learn simulation tools for Sensor Networks; Learn programming of Sensor nodes by running and modifying existing applications on real sensor nodes ; Implement a multi -hop Adhoc N etwork using a test bed of SoCs; Implement a few unicasting routing protocols on a test bed wher e the Phy and Mac layers are 802.11.ax ; Implement a few unicasting routing protocols by simulation where the Phy and Mac layers are 802.11.ax ; Develop a program to create clusters in a network of nodes in NS3. Chose an appropriate P hy and Mac layer impleme ntation; Design and implement a WSN application for a few typical scenarios using test bed and simulation tools. Three such applications may be as follows: a. Consider an ECG monitoring system where the ECG sensors sense electric impulses and sends it to a ma ster node. Design and implement a WSN for this application and analyze the result for different power levels varying from -3dB to -31dB b. The same ECG monitoring system is used by 3 different patients in different rooms of a hospital. The master node of all the three patients are communicating to a clinic station which is recording the patients data and send it to doctor s phone through an android app. c. Five source nodes sensing temperature values are deployed in the ground floor of a building and these nodes send the values to a sink node deployed in the same floor of the building. A hierarchical network having 2 cluster nodes and three source nodes under each cluster is implemented in the first floor of a building for sensing light intensities. The sink nodes of both networks average the received values and send it to a gateway node located in the second floor. (IT/PE/B/S/311C ) Artificial Intelligence Lab Implement different heuristic search techniques of AI in python ; Solve different AI problems using searc hing techniques using conventional procedur al programming languages; Study basics of a logic programming language ; Assignments on knowledge representation and reasoning using the logic programming language ; Design an Expert System as a case study . (IT/PC/ H/S/312 ) Compiler Lab Assignments using LEX; Assignments on Language transformation using YACC; Design & development of a two -pass assembler; Design & development of macro processor; Design of a linking loader. (IT/PC/B/S/313 ) Operating System Labo ratory Case study: UNIX; Assignments on Shell Scripting; Assignments on Inter Process Communication – Shared Memory, Semaphores, Message Queue etc; Assignments on Multithreading, using mutex, conditional mutex etc; Assignments on Signal Handling. (IT/PC/B/T/321 ) Design & Analysis of Algorithm s Introduction to analysis: Notion of algorithm, fundamental of analysis frameworks - Asymptotic Notations, worst -case and average -case complexity. Quick review of basic data structures and algorithms: Analysis of recursive/ non -recursive algorithm; Introduction to amortized analys is of algorithms. Sorting and Selection algorithms: finding minimum and maximum, kth order statistics, tournament and heap sort, lower bound for sorting. Hashing: introduction, collision resolution, hash functions, analysis of hashing with chaining an d with open addressing. Union -Find problem: tree representation of a set, weighted union and path compression - analysis. Design Techniques: dynamic programming: Fibonacci series, matrix chain multiplication; greedy - method: Huffman code, Knapsack problem; divide -and-conquer: quick sort, multiplying large number, matrix multiplication; backtracking: n -queen problem; Branch and bound technique: integer programming, traveling sales man. 3rd Year 2nd Semester Subject Code Subject Name Category Type Contact Credit Marks L T P IT/PC/B/T/321 Design & Analysis of Algorithms PC Basic 3 0 0 3 100 IT/PC/B/T/322 Information Security PC Basic 3 0 0 3 100 IT/PC/B/T/323 Web Technologies – II PC Basic 3 0 0 3 100 IT/PC/B/T/324 Multimedia Coding and Communications PC Basic 3 0 0 3 100 IT/PE/H/T/325A Soft Computing Elective -II PE Honours 3 0 0 3 100 IT/PE/H/T/325B Big Data IT/PE/H/T/325C Mobile Applications Development Open Elective OE Basic 3 0 0 3 100 IT/PC/B/S/321 Web Application Laboratory PC Basic 0 0 3 1.5 100 IT/PE/H/S/322A Soft Computing Lab Elective -II Lab PE Honours 0 0 3 1.5 100 IT/PE/H/S/322B Big Data Lab IT/PE/H/S/322C Mobile Applications Developme nt Lab IT/PC/B/S/323 Multimedia Lab PC Basic 0 1 3 2.5 100 Sub-Total 18 1 9 Total 28 23.5 900 String processing: string searching and pattern matching, KMP algorithm a nd its analysis Analysis of graph algorithms: shortest path algorithms, minimum spanning tree algorithms, network flow problems. Complexity classes: P, NP, NP -hard and NP -complete, some NP -complete problems, Approximation algorithms. (IT/PC/B/T/322 ) Information Security Overview and Security Attacks: Security Approaches, Principals of security, Types of attacks: Active attack - interruption, modification, fabrication; Passive attack – release of message contents, traffic analysis; Vir uses, Worms, Trojan horse. Basics of Cryptography: Terminologies of Cryptography, Substitution techniques and Transposition techniques. Characteristics of Good Encryption Technique, Types of Encryption Systems, Confusion and Diffusion, Cryptanalysis. Mathematics of crypto graphy: Integer arithmetic, Modular arithmetic, Matrices, Linear Congruence, Group, Ring, Field, Finite Field[GF (2p)], Primes, Primality Testing, Factorization, Chinese remainder theorem, Quadratic congruence, Exponentiation and Logarithm. Symmetric Key Encryption: Classical Encryption Techniques, Block Ciphers, Data Encryption Standard (DES), Advanced Encryption Standard (AES), RC4, Confidentiality Using Symmetric Encryption. Public -Key Encryption: Characteristics of Public Key System, RSA, Key Manage ment, Diffie - Hellman, Elliptic -curve cryptography (ECC) . Integrity, Authentication and Key management: Message Integrity and Message Authentication; Hash Algorithms - MD4, MD5, Secure Hash algorithm; Digital Signatures - RSA scheme, Elgamal scheme; Entity Authentication Protocols – Passwords, Challenge response, Zero Knowledge, Biometric; Key Management – Symmetric Key Distribution and Key Distribution center, Public Key D istribution. Image Encryption: Overview of image encryption, Confusion and diffu sion, Chaotic and Non -Chaotic Image encryption, Performance Measure. (IT/PC/B/T/323 ) Web Technologies – II Server -side Programming: Internet Programming paradigm, Servlets: Server -side Java, Advantages, Alternatives, Architecture, Life Cycle, GenericSer vlet and HttpServlet, Passing and Retrieving Parameters, Server -Side Include, Servlet -chains, Filters, Handling Cookies, Problems with Servlet, Security Issues Java Server Pages: JSP and HTTP, JSP Engines, How JSP Works, JSP and Servlet, Anatomy of a JS P Page, JSP Syntax, JSP Components, Beans, Session Tracking, Users Passing Control and Data between Pages, Sharing Session and Application Data Database Connectivity: JDBC Drivers, Basic Steps, Loading a Driver, Making a Connection, Execute an SQL State ment, SQL Statements, Retrieving Result, Getting Database Metadata, Scrollable and Updatable ResultSet, ResultSetMetadata CGI: Common Gateway Interface (CGI), Languages for CGI, Applications, Server Environment, Environment Variables, CGI Building Block s, CGI Scripting Using C, Perl, Python, Shell Script, etc. CGI Security, Alternatives and Enhancements to CGI Advanced Topics: XML -RPC, SOA, Simple Object Access Protocol (SOAP): SOAP Messages, Current SOAP Implementations, Sending and Receiving SOAP Me ssages, Web Services: Architecture and Advantages of Web Services, Web Services Description Language (WSDL), Creating and Examining WSDL Files , Overview of Universal Description, Discovery, and Integration (UDDI), UDDI Registries (Public and Private), Core UDDI Elements, Deploying and Consuming Web Services, Introduction to Cloud Computing Overview of J2EE —Introduction to JavaBeans, Bean Builder, Advantages of JavaBeans. BDK Introspection, Properties, BeanInfo Interface, Persistence, Customizer, JavaBean s API, EJB, Introduction to Struts Framework, Model -View -Controller (MVC) Framework (IT/PC/B/T/324 ) Multimedia Coding and Communications Multimedia Overview: Introduction, Multimedia presentation and production, Multimedia and hypermedia, Hardware and software requirements, Uses of multimedia, Multimedia Authoring, Editing and authoring tools.",
            "Text – types, Unicode standard on file format; Image and graphics, data types, file formats, color science and color model; Audio - digitization, midi, quantization and transformation of audio; Video - types of video signals, analog and digital video, television broadcast standards, pc video; animation - types, principals and techniques, 3D animation, camera, special effects, rendering.",
            "Introduction, Run -length coding, Variable length coding (Shannon - Fano, Huffman, adaptive Huffman), Dictionary based coding, Arithmetic coding, Lossless image compression.",
            "Introduction, Distorti on measure, Quantization, Transform coding, Wave -let based coding, Wavelet packets.",
            "JPEG standard, JPEG -2000 standard, JPEG - LS standard, Bi -level Image Compression standard.",
            "Introduction, Motion estimation, MPEG -1, MPEG -2, MPEG -4, MPEG -7 etc.",
            "ADPCM, psychoacoustics, MP3, MPEG.",
            "Basics of networks, multiplexing technologies, LAN, WAN, ATM, quality of multimedia data transmission, multimedia over IP (RTP, RTCP, RSVP, RTSP), multimedia over ATM networks.",
            "User interface, distributed multimedia application, Play back architecture, temporal relationship, synchronization, multime dia database system, feature extract of image, audio, video. Elective -II (IT/PE/H/T/325A ) Soft Computing",
            "Introduction to soft computing, comparison between soft computing and hard computing, Characteristics of Soft computing.",
            "Introduction to Fuzzy sets, Difference between fuzzy set and crisp set, why and when to apply fuzzy set, Probabilities & Fuzzy Sets, Details of membership functions, Fuzzy logic, Linguistic Variables, Operations on Fuzzy sets, Fuzzy relations, fuzzy rules & fuzzy reasoning.",
            "Difference with conventional control systems, Fuzzification, Rule Base, fuzzy inference system, Defuzzifi cation, Some applications of Fuzzy sets.",
            "Introduction, History and inspiration from biology (Darwinian Evolution, Genetics), why evolutionary computing.",
            "What is an evolutionary algorithm, components of evolutionary algorithm - representation, evaluation function (fitness function), population, parent selection mechanism,operators(Mutation ,recombination or crossover), survivor selection mechanism ,initialization and t ermination condition, example applications (Knapsack problem, Eight Queens problem).",
            "Introduction of Genetic Algorithms, Different Operat ors of GA -mutation, inversion, crossover and selection , Bit wise operation in GA, Convergence of GA, Multi -level Optimization, Multi - objective and Multimodal optimization, Non -Pareto approaches to solve MOOPs, Pareto -based approaches to solve MOOPs, Differ ences and similarities between GA and other traditional Methods, example applications (Job shop scheduling).",
            "DE as modified GA, generation of population, different operators with an example.",
            "Particle Swarm Optimization, Ant Colony Optimization with relev ant examples.",
            "Basic c oncepts, types of hybrid systems, advantages, GA in fuzzy logic controller design. (IT/PE/H/T/325B ) Big Data Introduction to Big Data Big data features and challenges, Problems with Traditional Large -Scale System, Sources of Big Data, 3 V’s of Big Data.",
            "HDFS Design & Goals • Understand Blocks and Configuration of block size • Block replication and replication factor • Understand Hadoop Rack Awareness and configure racks in Hadoop • File read and writes in HDFS. HADOOP Architecture, Planning for cluster, Hadoop Components, Modes of Hadoop",
            "Introduction , Architecture of Map -Reduce Word Count Example, Phases of a MapReduce program, Data -types in Hadoop MapReduce, Driver, Mapper and Reducer classes, InputSplit and RecordReader, Input format and Output format in Hadoop, Concepts of Com biner and Partitioner",
            "NOSQL Storage Architecture, CRUD operations with MongoDB, Querying, Modifying andManaging NOSQL Data stores, Indexing and ordering datasets(MongoDB/CouchDB/Cassandra)",
            "Introduction to PIG, Executi on Modes of Pig, Comparison of Pig with Databases, Grunt, Pig Latin, User Defined Functions, Data Processing operators. Hive : Hive Shell, Hive Services, Hive Metastore, Comparison with Traditional Databases, HiveQL, Tables, Querying Data and User Defined Functions. Hbase : HBasics, Concepts, Clients, Example, Hbase Versus RDBM S. Big SQL : Introduction (IT/PE/H/T/325C ) Mobile Applications Development",
            "History of mobile devices and OS, Features and Architecture of Mobile OS(Android, iOS, window s etc.) , S/W distribution, Programming tools for app",
            "Introduction, Features, Versions, Various Android devices, SDK, IDE System Requirements, Installation, Structure and lifecycle of an application for Android system, Android Project, Directory Structure, Configuration Settings, XML configuration files.",
            "Activity life -cycle, UI Design, Containers and components, Widgets and Layouts, Events and Event Handling, Intents: Implicit/Explicit intents, Managing application data, Processing of application resources, content providers, file system, Data persistence: backups, databases, Overview of Threads, The Application Main Thread, Thread Handlers, A Basic Threading Example, Creating a New Thread, Imple menting a Thread Handler, Passing a Message to the Handler",
            "Telephony services: Making calls, Monitoring data connectivity and activity, Accessing phone properties and status, Controlling the phone, Sending messages/emails, Network communi cation and internet applications, Sensors: How Sensors work, Using Orientation and Accelerometer sensors, Best practices for performance. Wi -Fi connections, Bluetooth communication: Basics, Permissions, Device discovery, Device connectivity, Server creati on, Connection management, Geographical location: Use of GPS data, Location based services, Finding current location and listening for changes in location, Working with Google Maps, Cloud/Web services: Consuming web services, Parsing JSON and XML, Using We bView",
            "Drawables, Basics of Design, 2D and 3D graphics processing, Canvas/Drawing using a view, Animations, Audio/video playback, MediaPlayer, SoundPool, Camera access: Taking and processing pictures , Media Recorder, Rend ering previews Simple game programming, Hardware Acceleration",
            "Security architecture, application signing, user identification, Rooting of Devices¸ file access, declaration and verification of permissions, performance, scalabilit y, modifiability, availability, Testing methodologies, Publishing, deployment, maintenance and management, version management, licenses, preparing for distribution (?) Open Elective (IT/PC/B/S/321 ) Web Application Laboratory Develop and demonstrate programs using HTML, JavaScript, Cascading Style Sheets, XML, DTD, Schema, XSLT, DOM CSS3, HTML5, Web Worker, Web Socket, Application Cache, Server Sent Events(SSI), Web Storage, IndexedDB, AJAX, JQuery, JSON Servlet, JSP, JDBC, CGI(Perl, PHP, Python, C/C ++, shell etc.), XML -RPC, SOAP, Web Service, J2EE Elective -II-Lab (IT/PE/H/S/322A ) Soft Computing Lab Assignments to implement different Fuzzy Membership functions for different parameter values, Fuzzy set s operations and its properties; Assignments on Fuzzy Vs Crisp Logic ; Assignments on Fuzzy controller using MATLAB Fuzzy logic toolbox ; Assignments on Analysis of Genetic Algorithm Life Cycle; Develop programs to solve Classical problems using GA ; Write programs to solve different problems like K napsack problem, n -Queens problem using Evolutionary Algorithm. Compare the performance o f different mutation operations; Assignments on Multi -Objective optimization problem; Assignments on Bio Inspired optimization problem (Particle Swarm Optimization, A nt Colony Optimization). (IT/PE/H/S/322B ) Big Data Lab Design and Develop one pass Map Reduce task on given dataset(s). For example, build an Inverted Index of words to t he documents which contain them; Design and Develop multi - pass Map Reduce task on g iven dataset(s); Develop programs to create, read, update and delete operatio ns on a document based database; Develop programs to create, read, update and delete operati ons on a column family database; Develop scripts to create a managed table in HIVE and load the data from HDFS; Develop scripts to create an external ta ble and load the data from HDFS; Write programs in Hive Script using JOINS and complex data types. (IT/PE/H/S /322C ) Mobile Applications Development Lab Introduction to the tools to be used in the lab. Develop and demonstrate programs as follows: A simple application, Applications with GUI, Applications for resource processing, Applications for data persistence, Applications for 2D and 3D graphics processing, multimedia processing , Applic ations using Camera , Applications using network connections, Telephony, SMS, Applications using Wi -Fi, Bluetooth, GPS, Web services , Applications using sensors. (IT/PC/B/S/323 ) Multimedia Lab Assignment on: Image editing using Photoshop ; Audio editing us ing Sound Forge ; Animation using Flash ; Video editing using Premier ; Authoring using Director ; Advanced Animation using 3D Max."
        ]
    },
    {
        "semester": "Unknown Semester",
        "subject_code": "IT/PC/B/T/411",
        "subject_name": "Machine Learning",
        "category": "N/A",
        "type": "N/A",
        "contact_L": 0,
        "contact_T": 0,
        "contact_P": 0,
        "credit": 0.0,
        "marks": 0,
        "topics": [
            "A brief introduction to Machine Learning, Applications of ML, Design Perspecti ve and Is sues in ML, Supervised Learning , Unsupervised Learning,A Formal Learning Model and its representation, The Runtime of Learning Evaluating Hypotheses – Estimating Hypotheses Accuracy, Basics of sampling Theory, Comparing Learning Algorithms; - Bayesian Learning – Bayes theorem, Concept learning, Bayes Optimal Classifier, Naïve Bayes classifier, Bayesian belief networks",
            "Early Models, Perceptron rule/multi -layer perceptrons, Artificial Neural Network, activation fu nction, multi -layer neural network.",
            "Training Neural Network: Risk minimization, loss function Back -propagation I, Back -propagation II, Initialization, Training & Validation regularization, model selection, and optimization , Conditional Random Fields: Linear chain, partition function, Markov network, Belief propagation, Training CRFs, Hidden Markov Model, Entropy.",
            "Hopfield Net, Boltzman machine, RBMs, Sigmoid net, Autoencoders.",
            "Perspectives and Issues in deep learning framework, Deep Feedforward Networks , Regularization for Deep Learning , Optimization for Training Deep Models , Convolutional Networks , Sequence Modeling: Recurrent and Recursive Nets 4th Year 1st Semester Subject Code Subject Name Category Type Contact Credit Marks L T P IT/PC/B/T/411 Machine Learnin g PC Basic 3 0 0 3 100 IT/PE/B/T/412A Data Warehousing and Data Mining Elective -III PE Basic 3 0 0 3 100 IT/PE/B/T/412B IoT and Next Generation Networks IT/PE/B/T/412C Bio-Informatics IT/PC/B/T/413 Distributed Computing PC Basic 3 0 0 3 100 IT/PC/H/T/414 Network Security PC Honours 3 0 0 3 100 IT/PC/B/S/411 Machine Learning Lab PC Basic 0 1 3 2.5 100 IT/PS/B/S/412 Project PS Basic 0 2 7 5.5 200 IT/PS/B/S/413 Seminar PS Basic 0 1 2 2 100 Internship - - - - - 0 - Sub-Total 12 4 12 Total 28 22 800",
            ": Linear Models: Linear Classification, Logistic Regression , Linear Discriminant Analysis, Separating Hyper -plane Approaches, SVM –Formulation, SVM –Interpretation & Analysis, SVMs for Linearly Non Separable Data",
            "Introduction to Reinforcement Learning , RL Framew ork , Solution Methods & Applications , Introduction to Immediate RL , Bandit Optimalitie s, Value function based methods",
            "Policy Search , REINFORCE , Contextual Bandits , Full RL Introduction Returns, Value Functions and MDPs Dynamic Progra mming and Monte carlo methods: Lpi Convergence , Value Iteration , Policy Iteration , Dynamic Programming",
            "Off Policy MC , UCT , TD(0) , Q-Learning Elective -III (IT/PE/B/T/412A ) Data Warehousing and Data Mining Module -1 Data Warehousing and Business Analysis: Basic concepts and Components of Data warehousing; Building a Data warehouse; Data Warehouse models -Data Mart; Metadata; Data Cube -multidimensiona l data model, Online Analytical Processing (OLAP), Multidimensional versus Multi -relational OLAP, OLAP Tools; Data Warehouse Design and Usage; Data Warehouse Implementation -OLAP Server Architectures -ROLAP versus MOLAP versus HOLAP; Data Cube Technology: Pr eliminary Concepts. Module -2",
            "History of Data Mining, Definition, Knowledge Discov ery vs. Data mining, Issues in data mining.",
            "Class Description, Characterization & Discrimination, Mining Frequent Patterns, Associations and Correlations, overview of cluster Analysis (preliminaries) and outlier analysis (prelimin aries), Evolution Analysis.",
            "Data Summarization, data Cleaning, data Integration and Transformation, data Reduction, Data Discretization and Concept Hierarchy Generation. Module -3",
            "Scalable Frequent Itemset Mining Methods, The Apriori Algorithm, Mining various Kinds of Association Rules, Pattern -Growth Approach a nd Vertical Data Format for mining Frequent Itemsets, From Association mining to Correlation Analysis, Constraint based Association Mining, Mining in Multilevel and Multidimensional Space, Constraint -Based Frequent Pattern Mining, High -Dimensional Data min ing with examples Module -4",
            "Issues Regarding Classification and Prediction, Ap plications on - Decision Tree Induction, Bayesian Classification, and Rule -Based Classification; Classification by Association, Model Evaluation and Selection, Methods of Improving Classification Accuracy, Classification by Back -propagation , Classification Using Frequent Patterns, Multiclass Classification, Semi -Supervised Classification, Applications on K -Nearest Neighbor Classifier. Module -5",
            "Types of data and requirements in Cluster Analysis, Partitioning methods , Application based Partitioning Methods in Large databases - From K -Means to CLARANS, Application of Hierarchical methods - BIRCH and Chameleon; Application of Density -Based Methods - DBSCAN, OPTICS, and DENCLUE; Grid based Methods - STING; and Clustering Hig h Dimensional Data - CLIQUE; Types of Outliers, Challenges in Outlier Detection, Outliers Detection Methods, Statistical Approaches, Proximity -Based Approaches, Outlier Detection in High -Dimensional Data with examples. Module -6",
            "Mining Text Data, Mining Biological Data, Time Series Data etc. (IT/PE/B /T/412B ) IoT and Next Gen eration Networks",
            "Defining IoT, characteristics of IoT, challenges of IoT, Technologies leading to IoT, Functional blocks of IoT, M2M vs IoT. IoT Ecosystem: 7 layer model and protocols.",
            "Performance parameters, issues and challenges, IEEE 802.15.4, 802.11 AH, LoRaWAN, LTE -A, Z-wave, G.9959",
            "Routing protocols: RPL, CORPL, Enc apsulation protocols: 6LoWPAN, IPv6 over G.9959.",
            "Need for new protocols, MQTT, SMQTT, CoAP, XMPP",
            "IEEE 1905.1, Smart transducer interface.",
            "Home Automation, Smart manufacturing and smart factory, Surveillance applications, Smart parking, Intelligent traffic systems, Smart vehicles, Smart water management, IoT for smart cities. Next genera tion Networks: MPLS, 5G Networks, MIMO, Vehicular Communication, SDN, Network slicing , D2D , Multi Radio Access Technologies (IT/PE/B /T/412C ) Bio-Informatics Fundamental of Cell Biolog y: Definition.",
            "protein and amino acid, DNA & RNA, Biological Sequence, structure and function, Genomes; Pattern recognition and prediction, Homology and Analogy.",
            "Introduction, Type of databases, Nucleotide sequence databases: Primary nucleotide sequence databases, Secondary nucleoti de sequence databases; Protein sequence databases, Sequence motif databases, Protein structure databases.",
            "Mapping and Sequencing Genomes, Genetic Interactions, Protein profiling. Sequence alignment and database search ing: Introduction to database search, Algorithms issues in database search, Sequence database search, Single sequence alignments, Pair wise alignments: Scoring matrix, PAM, BLOSUM; Dynamic Programming, Heuristic methods: FASTA, BLAST; Multiple Sequence Ali gnments.",
            "Feature extraction, Classification: Linear classification, linear classification function and artificial neural, artificial neural networks, Support vector machines; Clustering: K -means clustering, hierarchical clustering; Dimen sionality Reduction & Principal Component analysis: SDV, geometric interpretation of SDV, PLS method; Parametric Transformations: Hough transform, Generalized Hough transforms, geometric hashing;",
            "phylogeny: Ultrasonic trees, parsimony, Ultrametric problem, perfect phylogeny, phylogenetic alignment, connection between multiple alignment and tree construction",
            "DNA Mapping and sequencing, Map alignment, Large scale sequencing and alignment, Shotgun, DNA sequencing, Se quence assembly, Gene predictions, Molecular predictions with DNA strings",
            "Machine Learning Methods, Hidden Markov models, Applications of HMM in gene identification",
            "Fragment assembly, Se quence alignment, Gene finding, Promoter identification, Phylogenetic tree construction, Protein superfamily classification, Protein structure prediction, Protein folding (IT/PC/B/T/413 ) Distributed Computing Fundamental concepts: Models, Issues, Comple xity measures, proving correctness",
            "Concept of clock in Distributed System, Limitation of Distributed System, Clock synchronization, Lamport’s Logical Clock, Vector Clocks, Causal ordering of messages - Birman - Schiper Stephen Proto col, Schiper Eggli Sandoz Protocol.",
            "System model, Snapshot algorithms for FIFO channels, Variations of Chandy -Lamport algorithm, Snapshot algorithms for non -FIFO channels, Snapshots in a causal delivery sys tem, Monitoring global state, Necessary and sufficient conditions for consistent global snapshots, Finding consistent global snapshots in a distributed computation.",
            "Introduction and issues",
            "Wave and Traversal Algorithms: Definition and use of wave algorithms, A collection of wave algorithms, Traversal algorithms, Leader Election algorithms: Introduction, Ring Networks, Arbitrary networks, The Korach -Kutten -Moran Algorithm.",
            "Permis sion based (Lamport, Ricart -Agarwala, Roucairol -Carvalho, Maekawa), Quorum -based mutual exclusion algorithms (Maekawa’s algorithm, Agarwal –El Abbadi quorum -based algorithm), Token based (Suzuki Kasami, Raymond’s Tree -based algorithm)",
            "System model, Models of deadlocks, Knapp’s classification of distributed deadlock detection algorithms, Mitchell and Merritt’s algorithm for the single resource model, Chandy –Misra – Haas algorithm for the AND model, Chandy – Misra –Haas algorithm for the OR mo del, Kshemkalyani – Singhal algorithm for the P -out-of-Q model",
            "NFS, Google file systems",
            "The Management of Distributed Transactions, A Framework for Transaction Management , Supporting Atomicity of Distri buted Transactions, Concurrency Control for Distributed Transactions, Architectural Aspects of Distributed Transactions;",
            "Foundation of Distributed Concurrency Control, Distributed Deadlocks, Concurrency Control based on Ti mestamps, Optimistic Methods for Distributed Concurrency Control, Execution schedules; (IT/PC/H/T/414 ) Network Security Introduction to Network Security: Overview - Define trust, weaknesses and vulnerabilities, Security Objectives; Understanding Vulnera bilities the Need for Security - Risk and Vulnerability, TCP/IP Suite Weaknesses, Buffer Overflows, Spoofing Techniques, Social Engineering; Understanding Defenses - Digital IDs, Intrusion Detection System, Encrypted Login, Firewalls, Reusable Passwords, Antivirus Software, Encrypted Files, Biometrics",
            "E-MAIL -E-mail Architecture; PGP – Scenarios, Key Rings, PGP Certificate, Key Revocation, PGP packets and Messages; S/MIME – MIME, S/MIME, Application of S/MIME Security at t he Transport layer: SSL Architecture, Four Protocols – Handshake, ChangeCipherSpec, Alert, Record, SSL Message formats, Transport Layer Security",
            "IPSec – Transport and Tunnel Mode, IPSec Security Association, Security protocol s, Services Provided by IPSec , Security Policy, Internet Key Exchange (IKE) - Improved Diffie -Hellman Key Exchange, Phases and Modes, SA Algorithms, ISKAMP",
            "Definition, Types of Firewalls - Circuit -Level Firewalls, Proxy Server Firewalls, Non - stateful Packet Filters, Stateful Packet Filters, Personal Firewalls (Packet Inspection Firewalls, Application Proxy Server: Filtering Based on Known Services, Virtual Private Network (VPN) Firewalls, Small Office or Home (SOHO) Firewalls, NAT Firewalls), Co nfiguration and Implementation of a Firewall, Improving Security Through the Firewal, Firewall Services and Limitations",
            "Access Rights, Access Control Systems - Physical Access Control, Access Cards, Electronic Surveillanc e, Biometric, Event Monitoring; Authorization Systems – Centralize, Decentralized, Implicit, Explicit, Authorization Principles - Least Privileges, Separation of Duties; Web Access and Authorization",
            "Authentication Elements, Types of Authen tication - Non-repudiable and repudiable; Authentication Methods - Password Authentication, Public Key Authentication, Remote Authentication, Anonymous Authentication, Digital Signatures -Based Authentication, Wireless Authentication IEEE 802.11 Wireless L AN Security: Authentication – Pre-WEP authentication, Authentication in WEP, Authentication and Key agreement in 802.11i; Confidentiality and Integrity - Data Protection WEP, Data Protection TKIP and CCMP. Types of attacks, their analysis and mitigations : phishing, wormhole, Sybil, DOS -DDOS, Intrusion Detection System",
            "Recapitulation : Technologies for Web Services, WS -Security - Token Types, XML Encryption, SML Signatures, SAML – Assertion Type, Creating/Communicating Assertions, O ther Standard – WS-Trust, WS -Security Policy (IT/PC/B/S/411 ) Machine Learning Lab Be familiar with necessary tools and languages for using machine learning techniques. Assignments for finding the most specific hypothesis from a given set of training data samples. Assignments on implementation of artificial neural networks (ANN) with back propagation and belief propagation , and using them to solve real world problems. Assignments combining H idden Markov Model and ANN. Assignments using CNN and RNN to solve practical problems in areas such as game playing, sentence understanding. Implementation of statistical classifiers for a sample training data set and to compute different metrics (such as accuracy, recall) of these classifiers. Develop machine learning me thods to cluster data and modify existing methods to solve the problem better. Be familiar with tools for reinforcement learning (RL) (such as openAI gym or TensorLayer in TensorFlow) and assemble RL modules for tackling some interesting problems. (IT/PS/ B/S/412 ) Project Each student will have to carry out a project work for one year based on a suitable topic chosen in consultation with a teacher (the supervisor) concerned. This work will continue for two semesters in the final year. The marks for this s ubject will be awarded at the end of the second semester along with the marks obtained in ( IT/PS/B/S/422 ). (IT/PS/B/S/413 ) Seminar In this subject, each student will have to present a seminar on a topic in consultation with a teacher concerned and will b e evaluated based on the content and format of his/her presentation. The marks for this subject will be awarded at the end of the second semester along with the marks obtained in (IT/PS/B/S/423 ). The topic must be related to the broad domains of study in t his course but the topic must not be chosen such that it is wholly contained in the syllabus of some subject in this course. (IT/PC/H/T/421 ) Data Science Introduction to Data Science: Basics of Data Science, The need for Business Analytics, Data Science Life Cycle, Different tools available for Data Science",
            "Data exploration, Introduction to Research Methods, Central Tendency, Variability, Standardizing, Normal Distribution, Sampling Distributions, Hypothesis Testing, Estimation (Point estimate and Interval estimate), t -tests , ANOVA, Correlation, Regression, Chi -square Test",
            "Introduction of Hadoop file system and Map -reduce, Virtualization platforms, Cloud platforms; Programming tools – R, Python, etc. R: R packages and R Operators; Python libraries: SciPy and sci -kitLearn, PyBrain, Pylearn2;",
            "Design issues related to IR, Working principle of Search Engine like Google, Well -known IR techniques used in various domains. Business Intelligence and Financ ial Analysis: Understanding the BI process, Strategies of information gathering, the distinction between intelligence, information and data, Information asymmetry and competitive advantage, comparison with competitive intelligence, Comparison with busines s analytics, Success factors of implementation.",
            "Types of Networks - nodes, edges, adjacency matrix, one and two-mode networks, node degree, Random network models, Concepts: connected components, giant component, prefe rential attachment, Network centrality, betweenness, closeness, eigenvector centrality (+ PageRank), network centralization, Community: clustering, community structure. Introduction to Sentiment, Sentiment analysis with examples; Recommender System: Introd uction to Recommender 4th Year 2nd Semester Subject Code Subject Name Category Type Contact Credit Marks L T P IT/PC/H/T/421 Data Science PC Honours 3 0 0 3 100 IT/HS/B/T/422 Management HS Basic 3 0 0 3 100 IT/PE/H/T/423A Pattern Recognition and Applications Elective -IV PE Honours 4 0 0 4 100 IT/PE/H/T/423B NLP and Text Mining IT/PE/H/T/423C Cyber Forensics and Security IT/PC/B/T/424 Digital Image Processing PC Basic 3 0 0 3 100 IT/PC/B/S/421 Comprehensive Viva Voce PC Basic 0 0 3 1.5 100 IT/PS/B/S/422 Project PS Basic 0 2 7 5.5 200 IT/PS/B/S/423 Seminar PS Basic 0 1 2 2 100 Sub-Total 13 3 12 Total 28 22 800 Systems, Eliciting Ratings and other Feedback Contributions, Implicit Ratings, Taxonomy of Recommender Systems, Non -Personalized Recommenders Content -Based Recommenders, Methods of Filtering.",
            "Introduction to data v isualization, Terminology. Basic Charts and Plots, Multivariate Data Visualization; Principles of Perception, Text Data Visualization, Interactivity and Animation; Temporal Data Visualization, Geospatial Data Visualization, Visualization Case Studies, Redesign Principles and Design Dimensionality",
            "Introduction of Time Series data, Time Series variables, Different components of Time Series data, Visualize the data to identify Time Series Components, Implement ARIMA model for forecasting, Expone ntial smoothing models, Identifying different time series scenario based on which different Exponential Smoothing model can be applied, Implement respective ETS model for forecasting (IT/HS/B/T/422 ) Management Principles of managements: Concepts of mana gement, development of scientific management, principles of Frederick Taylor & Henry Favol, functions such as planning, organizing staffing leading, motivating communicating controlling decision making span of control.",
            "Meaning, functi ons of personal management, manpower planning, collective bargaining, wages & salary administration, labor welfare, training, trade unions, Industrial Factories Act, Industrial Boils Act, Trade Union Act.",
            "Plant location, plant layout, ty pes of maintenance such as break down, predictive & preventive maintenance, stores management, industrial safety, causes & cost of accidents, safety programs, production planning & control job, batch & process type of production.",
            "Definition & scope, selling & modem concepts of marketing, market research, new product development, product life cycle, product lunching, sales promotion, pricing, channels of distribution, advertising market segmentation, marketing mix. Material Management : Importance of Materials Management, Classification, Codification, Forecasting, Necessity of Inventory.",
            "Sources of finance, financing organization, types of capital, elements of costs & allocations of indirect expenses, cost contr ol, break even analysis, budges & budgetary control, equipment replacement policy, make or buy analysis, balance sheet, ratio analysis, profit & loss statement. Elective -IV (IT/PE/H/T/423A ) Pattern Recognition and Applications Module I : Introduction and mathematical preliminaries : Introduction to Pattern recognition, its Applications and Examples, Basics of Linear Algebra and Vector Spaces, Basics of probability theory, Estimation theory, Matrices, Metric and non -metric proximity measures, Distance Matri ces, Decision boundary, Decision Region, Difference between Supervised and unsupervised learning, Training set, test set; standardization and normalization. Module II : Classification techniques: Supervised Learning, Bayes decision rule, Errors in probabi lity theory, Linear Discriminant Function, Non-linear Decision Boundaries, Minimum Distance Classifier, K -NN Classifier, Fisher’s LDA, Support Vector Machine, Bagging, Boosting / AdaBoost, Regression & Classification, Logistic Regression, Decision Trees. Module III : Clustering techniques : Unsupervised Learning, Basics of Clustering; similarity / dissimilarity measures; clustering criteria, Minimum within cluster distance criterion, K -means algorithm, Single linkage and complete linkage algorithms, MST, K -medoids, DBSCAN Module IV : Feature Extraction & Selection : PCA, Kernel PCA, Branch and bound algorithm, sequential forward / backward selection algorithms, Probabilistic separability based criterion functions, interclass distance based criterion functions . Module V : Advancement and application of pattern recognition: Applications of machine learning and pattern recognition in solving problems drawn from domains of audio classification, bio - metric recognition, image retrieval, bio -informatics etc. (IT/PE /H/T/423B ) NLP and Text Mining NLP Basics of NLP: Human languages, models, ambiguity, processing paradigms; Phases in natural language processing applications; Text representation in computers, encoding schemes, Regular Expressions, Finite State Autom ata, Word Recognition, lexicon, Word Tokenization, Normalization, Sentence Segmentation, Named Entity Recognition, Multi Word Extraction, Spell Checking – Bayesian Approach, Minimum Edit Distance, Context Free Grammar and Parsing Morpholog y and Finite St ate Transducers Inflectional and Derivational Morphology, Finite State Morphological Parsing, The Lexicon and Morphotactics, Morphological Parsing with Finite State Transducers, Combining FST Lexicon and Rules, Orthographic Rules and Finite State Transduc ers, Porter Stemmer Introduction to N -grams Simple (Unsmoothed) N -grams, Smoothing – Add-One Smoothing, Witten -Bell Discounting, Good - Turing Discounting; Backoff, Deleted Interpolation, N -grams for Spelling, Entropy, Cross Entropy for comparing models. Hidden Markov Models and Parts Of Speech Tagging Markov Chain, Hidden Markov Models, Forward Algorithm, Viterbi Algorithm, Part of Speech Tagging: Rule based POS tagging, Stochastic POS tagging, Transformation based tagging, Multiple tags and multiple wor ds, Handling of unknown words, named entities, multi word expressions. Semantics analysis Meaning representation, Syntax - Driven Semantic analysis, Relation among lexemes and their senses - Homonymy, Hyponymy, Synonymy. Lexical semantics, WordNet: A datab ase of lexical relations, Word Sense Disambiguation, Computational Lexical Semantics: Thesaurus based and Distributional Word Similarity. Text Mining Information Retrieval and Extraction Boolean Retrieval, Term weighting and vector space model, Term -docu ment incidence, The Inverted Index, Query Optimization, Phrase Queries, Ranked Retrieval – Term Frequency – Inverse Document Frequency based ranking, Zone Indexing, Query term proximity, Cosine ranking, Combining different features for ranking, Search Engi ne Evaluation, Relevance Feedback Question Answering and Textual Entailment Open and Restricted Domain Question -Answering; Question Classes and Processing; Context and Data Source; Extraction and Formulation of Answers; Web exploitation: Real Time, Multil ingual and Interactive QAs; Textual Entailment: Learning to recognize features; Textual Inference and Semantic Entailment. Text Summarization Automatic Summarization: Factors and Directions, Extraction, Abstraction, Maximum Entropy and Aided Summarization ; Keyphrase Extraction; Supervised and Unsupervised Learning for Sentence Compression, Sentence Fusion, Document Summarization: Single and Multidocument. Performance Measure Precision, Recall and F -Measure, Confusion Matrix; MAP, MRR, N -gram Co -Occurrenc e Statistics for Summarization; Measures: Intrinsic (Coherence, Informativeness, Utility Method, Content Similarity, BLEU and ROUGE) (IT/PE/H/T/423C ) Cyber Forens ics and Security Introduction to Computer Forensics: computer crimes, evidence, extraction, preservation, etc. Overview of hardware and operating systems: structure of storage media/devices; windows/Macintosh/ Linux -- registry, boot process, file systems, file metadata. Data recovery: identifying hidden data, Encryption/Decryption, Steganogra phy, recovering deleted files. Digital evidence controls: uncovering attacks that evade detection by Event Viewer, Task Manager, and other Windows GUI tools, data acquisition, disk imaging, recovering swap files, temporary &cache files Computer Forensic tools: Encase, Helix, FTK, Autopsy, Sleuth kit Forensic Browser, FIRE, Found stone Forensic ToolKit, WinHex, Linux dd and other open source tools. Network Forensic: Collecting and analyzing network -based evidence, reconstructing web browsing, email activi ty, and windows registry changes, intrusion detection, tracking offenders, etc. Mobile Network Forensic: Introduction, Mobile Network Technology, Investigations, Collecting Evidence, Where to seek Digital Data for further Investigations, Interpretation of Digital Evidence on Mobile Network. Software Reverse Engineering: defense against software targets for viruses, worms and other malware, improving third -party software library, identifying hostile codes -buffer overflow, control hijacking attacks, provisi on of unexpected inputs, Exploitation techniques and fuzzing - Finding vulnerabilities and exploits. Dealing with bad (legacy) application code: Sandboxing and Isolation. Least privilege, access control, operating system security Malicious Software and Sof tware Security - Malicious Web, Internet Security Issues, Types of Internet Security Issues, Computer viruses, Spyware, Key -Loggers, Secure Coding, Electronic and Information Warfare. Mobile platform security models - Android, iOSMobile platform security mo dels, Detecting Android malware in Android markets. Basic web security model: Browser content, Document object model (DOM), Same -origin policy. Web Application Security: SQL injection, Cross -site request forgery, Cross -site scripting, Attacks and Defense s, Generating and storing session tokens, Authenticating users, The SSL protocol, The lock icon, User interface attacks, Pretty Good Privacy. Computer crime and Legal issues: Intellectual property, privacy issues, Criminal Justice system for forensic, audi t/investigative situations and digital crime scene, investigative procedure/standards for extraction, preservation, and deposition of legal evidence in a court of law. (IT/PC/B/T/424 ) Digital Image Processing Fundamentals: Overview of Image Processing S ystem, image digitization (sampling and quantization), basic relationship between pixels, Fundamentals of Color image and Color Models",
            "Fourier transform (1D, 2D) and its properties, FFT, DCT, Hadamard transform, Karhunen – Loeve transforms .",
            "Spatial Domain methods - Contrast Intensification (linear and nonlinear stretching), Histogram equalization, Histogram specification, Spatial filtering: Smoothing (liner, order - statistic), sharpening filters (Laplacian), Frequency domai n filters : Smoothing, Sharpening filters, Homomorphic filtering.",
            "Detection of discontinuities (point, line & edge), Edge Linking and Edge Following by Local Processing, Hough Transform, Region Extraction by Pixel based Approach (Thresh olding, Choice of Feature, Optimum Threshold etc.), Region Extraction by Region based Approach (Region Growing, Splitting, Merging, Split and Merge).",
            "Preliminaries, Erosion and Dilation, Opening and Closing, Some Basic Morph ological Algorithms: boundary extraction, region filling.",
            "Representation: Chain Codes, Polygonal Approximation, Skeletons, medial axis transform, thinning, Descriptor: shape number, Fourier descriptor, statistical moment s, Geometrical Attributes (perimeter, area, etc.), Texture Descriptor (GLCM).",
            "Objective, Feasibility, performance measure, lossy/lossless compression, Huffman coding, Arithmetic coding, block truncation coding, vector quantization, JPEG. (IT/PC/B/S/421 ) Comprehensive Viva Voce Each student will have to attend a viva -voce examination before a panel of experts drawn from people inside and outside Jadavpur University. Questions will be asked from any topic taught as a part of this curriculu m. (IT/PS/B/S/422 ) Project Each student will have to carry out a project work for one year based on a suitable topic chosen in consultation with a teacher (the supervisor) concerned. This subject is in continuation to the project work started in the fir st semester of the fin al year in the subject ( IT/PS/B/S/412 ). The marks for this subject will be awarded at the end of the second semester along with the marks obtained in ( IT/PS/B/S/412 ). (IT/PS/B/S/423 ) Seminar In this subject, each student will have t o present a seminar on a topic in consultation with a teacher concerned and will be evaluated based on the content and format of his/her presentation. The topic must be related to the broad domains of study in this course but the topic must not be chosen such that it is wholly contained in the syllabus of some subject in this course. Open Electives (Catered by Dept. of IT) To be taught in o dd Semester (FET/OE/B/T/0XX) Database Management Systems Basics",
            "History of Evolution of DBMS and a dvantages over traditional file system, Three -schema architecture of DBMS and Data Independence. Introduction to DDL and DML. Ideas about different kind of users of DBMS and available databases in market. Data Model: Introduction to Relational data mode l; Keys, Entity -Relationship Model , Relational Algebra Database Design: Different types of dependenci es, N ormalization SQL: Introduction to SQL, Application development using SQL Data Storage and Querying: Physical data structure ,Evaluation of Relatio nal Algebra expressions Transaction Management: Transaction Processing, Concurrency control and Recovery management , Transaction Model Properties and State , Serializability, Lock -based, Two -phase Locking . To be taught in even Semester (FET/OE/B/T/0XX) Object Oriented Programming Fundamentals Basic Concepts of Object Oriented Programming (OOP) – Objec ts, Classes and Message Passing, Differences between conventional and Object -Oriented programming, advantages and disadvantages of OOP. Enhancements over Procedural Languages: New data types. Function Overloading and its resolution, New dynamic allocation and de -allocation methods.",
            "Notions of abstraction, encapsulation, information hiding and modularity. Instantiation and initializati on of obje cts; constructor and destructor, Access Specification, Functions and methods; self reference of objects, Copy Constructor, Static Members.",
            "Basic concept of IS -A relationship. ― protected‖ access specification, Initialization and de -initialization of derived objects, Polymorphic m ethod calls and dynamic binding Abstrac t methods and classes. Examples, IS-A versus IMPLE MENTED -IN-TERMS -OF relationship, Multiple Inheritance, The problem of multiple occurrence of the same base and its solution.",
            "Fundamental ideas, Examples of overloading with arithmetic, relational operators. Overloading of unary operators others. Basic I/O and File I/O.",
            "The idea of exception handling and i ts superiority over traditional error handling. Semantics of try-catch blocks and throw ."
        ]
    }
]